{
	"id": "weatherForecast",
	"name": "Weather Forecast, CAP alerts",
	"description": {
		"fr_FR": "Ce plugin permet de récupérer la météo actuelle et les prévisions météorologiques sur quelques jours en utilisant les sources OpenWeather ou WeatherAPI. Les heures de lever et coucher du soleil sont calculées sans connexion externe. Un widget est fourni permettant d'afficher la météo sous une horloge similaire à celle du plugin horlogeHTC. Les alertes Meteoalarm sont aussi récupérées.",
		"en_US": "This plugin allows to retrieve the current weather and the weather forecast for a few days using OpenWeather or WeatherAPI sources. Sunrise and sunset times are calculated without external connection. A widget is provided to display the weather under a clock similar to the one in the horlogeHTC plugin. Meteoalarm alerts are also retrieved.",
		"de_DE": "Dieses Plugin ermöglicht das Abrufen des aktuellen Wetters und der Wettervorhersage für einige Tage unter Verwendung von OpenWeather- oder WeatherAPI-Quellen. Die Berechnung der Sonnenaufgangs- und Sonnenuntergangszeiten erfolgt ohne externe Verbindung. Es steht ein Widget zur Verfügung, um das Wetter unter einer Uhr anzuzeigen, das dem horlogeHTC-Plugin ähnelt. Auch Meteoalarm-Warnmeldungen werden abgerufen.",
		"es_ES": "Este plugin permite obtener el clima actual y las previsiones meteorológicas para unos días utilizando fuentes OpenWeather o WeatherAPI. Las horas de salida y puesta del sol se calculan sin ninguna conexión externa. Se proporciona un widget para mostrar el tiempo bajo un reloj similar al del plugin horlogeHTC. También se recuperan las alertas de Meteoalarm."
	},
	"utilization": "Renseignez vos clés API openweathermap et/ou weatherapi dans la configuration du plugin. Créez un équipement, choisissez la source de données OpenWeather ou WeatherAPI et indiquez les coordonnées du lieu désiré.",
	"licence": "AGPL",
	"author": "jpty",
	"require": "3.3",
	"category": "weather",
	"changelog": "https://jpty.github.io/jeedom/plugins/weatherForecast/fr_FR/changelog.html",
	"changelog_beta": "https://jpty.github.io/jeedom/plugins/weatherForecast/fr_FR/changelog.html",
	"documentation": "https://jpty.github.io/jeedom/plugins/weatherForecast/",
	"documentation_beta": "https://jpty.github.io/jeedom/plugins/weatherForecast/",
	"compatibility": [
		"smart",
		"diy",
		"v4"
	],
	"language": [
		"de_DE",
		"en_US",
		"es_ES",
		"fr_FR"
	]
}